wouyanglv/bmi160/nRF5_SDK_17.0.0_9d13099/examples/ble_peripheral/implantable_MA/main.c
#define DEAD_BEEF                           0xDEADBEEF                              /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */


#define TIMESTAMP_PRECISION   1000000000
#define RTC_BIT_WIDTH         24

#define WATERMARK_FRAMES  38                      /* FIFO level that triggers interupt */
#define BYTES_PER_FRAME 6


BLE_BIOSIG_SVC_DEF(m_biosig_svc);                                   /**< BioSignal service instance. */
NRF_BLE_GATT_DEF(m_gatt);                                           /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);                                             /**< Context for the Queued Write module.*/
BLE_ADVERTISING_DEF(m_advertising);                                 /**< Advertising module instance. */
APP_TIMER_DEF(m_startup_delay_timer_id);                            /**< Startup delay timer. */


static uint16_t m_conn_handle         = BLE_CONN_HANDLE_INVALID;    /**< Handle of the current connection. */

static ble_uuid_t m_adv_uuids[] =                                   /**< Universally unique service identifiers. */
{
    {BLE_UUID_BIOSIG_SERVICE,           BLE_UUID_TYPE_VENDOR_BEGIN}
};

static bool             m_startup_delay;

struct bmi160_dev sensor;
struct bmi160_fifo_frame fifo_frame;
struct bmi160_cfg m_accel_cfg;
static bool watermark_triggered;
static uint8_t fifo_buff[WATERMARK_FRAMES * BYTES_PER_FRAME];    

static const nrfx_rtc_t   m_rtc = NRFX_RTC_INSTANCE(2); /**< Declaring an instance of nrf_drv_rtc for RTC2 (RTC0 is used by BLE, RTC1 used by app timer). */
static uint64_t           m_rtc_overflows;
static uint64_t           m_ns_per_tick;
static bool               m_rtc_init;

/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num   Line number of the failing ASSERT call.
 * @param[in] file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Clear bond information from persistent storage.
 */
static void delete_bonds(void)
{
    ret_code_t err_code;

    NRF_LOG_INFO("Erase bonds!");

    err_code = pm_peers_delete();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for starting advertising.
 */
void advertising_start(bool erase_bonds)
{
    if (erase_bonds == true)
    {
        delete_bonds();
        // Advertising is started by PM_EVT_PEERS_DELETE_SUCCEEDED event.
    }
    else
    {
        ret_code_t err_code;

        err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
        APP_ERROR_CHECK(err_code);
    }
}


/**@brief Function for advertising wrapper.
 */
static void advertising_start_handler(void *p_event_data, uint16_t event_size) 
{
  advertising_start(false);
}

/**@brief Function for handling Peer Manager events.
 *
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_evt_handler(pm_evt_t const * p_evt)
{
    pm_handler_on_pm_evt(p_evt);
    pm_handler_flash_clean(p_evt);

    switch (p_evt->evt_id)
    {
        case PM_EVT_PEERS_DELETE_SUCCEEDED:
            advertising_start(false);
            break;

        default:
            break;
    }
}

/**@brief Function for handling the Startup Delay timer timeout.
 *
 * @details Can now start normal startup
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */
static void startup_delay_timeout_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);
    m_startup_delay = false;
}



/**@brief Function starting the internal LFCLK oscillator.
 *
 * @details This is needed by RTC1 which is used by the Application Timer
 *          (When SoftDevice is enabled the LFCLK is always running and this is not needed).
 */
static void lfclk_request(void)
{
    ret_code_t err_code = nrf_drv_clock_init();
    APP_ERROR_CHECK(err_code);
    nrf_drv_clock_lfclk_request(NULL);
}


char *uint64_to_string (uint64_t input)
{
     static char result [21] = "";
     memset(&result [0], 0, sizeof(result));
     char temp [21] = "";
     char c;
     uint8_t base=10;

     while (input)
     {
        int num=input % base;
        input /= base;
        c= '0' + num;

        sprintf(temp, "%c%s", c, result);
        strcpy(result, temp);
     }
     return result;
}

/** @brief: Returns the timestamp (since power up) in usecs.
 */
static uint64_t rtc_timestamp_get()
{
    uint64_t ticks;
    uint64_t timestamp;

    ticks = nrfx_rtc_counter_get(&m_rtc);
    timestamp = ((m_rtc_overflows << RTC_BIT_WIDTH) + ticks) * m_ns_per_tick;

    return timestamp;
}


/** @brief: Function for handling the RTC2 interrupts.
 * Triggered on TICK and OVERFLOW match.
 */
static void rtc_handler(nrfx_rtc_int_type_t int_type)
{
    if (int_type == NRFX_RTC_INT_OVERFLOW)
    {
        //keep track of overflow count to determine time since start
        m_rtc_overflows++;
        nrf_rtc_event_clear(m_rtc.p_reg, NRF_RTC_EVENT_OVERFLOW);
    }
    else if (int_type == NRFX_RTC_INT_TICK)
    {
        //first tick, clear counter and continue initialization
        nrf_rtc_event_clear(m_rtc.p_reg, NRF_RTC_EVENT_TICK);
        nrfx_rtc_tick_disable(&m_rtc);
        nrfx_rtc_counter_clear(&m_rtc);
        m_rtc_init = true;
    }
}


/** @brief Function initialization and configuration of RTC driver instance.
 */
static void rtc_config(void)
{
    uint32_t err_code;

    m_rtc_init = false;
    m_rtc_overflows = 0;
    float sec_per_tick = ( ((float)APP_TIMER_CONFIG_RTC_FREQUENCY + 1.0f) ) / (float)NRFX_RTC_DEFAULT_CONFIG_FREQUENCY;
    m_ns_per_tick = sec_per_tick * TIMESTAMP_PRECISION;
//    SEGGER_RTT_printf(0,"sec per tick: %f\r\n", sec_per_tick);
//    SEGGER_RTT_printf(0,"m_ns_sec per tick: %d\r\n", m_ns_per_tick);


    //Initialize RTC instance
    nrfx_rtc_config_t config = NRFX_RTC_DEFAULT_CONFIG;
    config.prescaler = 0;
    err_code = nrfx_rtc_init(&m_rtc, &config, rtc_handler);
    APP_ERROR_CHECK(err_code);

    //Power on RTC instance
    nrfx_rtc_counter_clear(&m_rtc);
    nrfx_rtc_overflow_enable(&m_rtc, true);
    nrfx_rtc_tick_enable(&m_rtc, true);
    nrfx_rtc_enable(&m_rtc);
}


/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{
    ret_code_t err_code;

