wouyanglv/bmi160/nRF5_SDK_17.0.0_9d13099/examples/ble_peripheral/implantable_MA/main.c
    uint8_t data = 0;

    dev->accel_cfg.odr = BMI160_ACCEL_ODR_1600HZ;  // There is a problem setting ODR to 1600 Hz. If using 1600 Hz, do in set_accel_conf() in bmi160.c;
    dev->accel_cfg.range = BMI160_ACCEL_RANGE_4G; //Not sure why 2G does not work. 
    dev->accel_cfg.bw = BMI160_ACCEL_BW_NORMAL_AVG4;
    dev->accel_cfg.power = BMI160_ACCEL_NORMAL_MODE;
    dev->gyro_cfg.power = BMI160_GYRO_SUSPEND_MODE;    
    rslt = bmi160_set_power_mode(dev);
    rslt = bmi160_set_sens_conf(dev);

    
    fifo_frame.data = fifo_buff;
    fifo_frame.length = WATERMARK_FRAMES * BYTES_PER_FRAME;
    dev->fifo = &fifo_frame; //Without instancing dev->fifo, setting values to dev->fifo->... fails.
    rslt = bmi160_set_fifo_config(BMI160_FIFO_ACCEL, BMI160_ENABLE, dev);

    rslt = bmi160_set_fifo_wm(WATERMARK_FRAMES * BYTES_PER_FRAME/4, dev); //watermark unit is 4 bytes

    struct bmi160_int_settg int_config;
    int_config.int_channel = BMI160_INT_CHANNEL_1;
    int_config.int_type = BMI160_ACC_GYRO_FIFO_WATERMARK_INT;
    int_config.int_pin_settg.output_en = BMI160_ENABLE;
    int_config.int_pin_settg.output_mode = BMI160_DISABLE;
    int_config.int_pin_settg.output_type = BMI160_DISABLE;
    int_config.int_pin_settg.edge_ctrl = BMI160_ENABLE;
    int_config.int_pin_settg.input_en = BMI160_DISABLE;
    int_config.int_pin_settg.latch_dur = BMI160_LATCH_DUR_NONE;    
    bmi160_set_int_config(&int_config, dev);
   
    return rslt;
}


uint64_t prev_timestamp = 0;
uint32_t int_cnt = 0;
uint32_t flush = 0; 
int8_t read_sensor_accel_headerless(struct bmi160_dev *dev)
{
     int8_t rslt = BMI160_OK;
     ret_code_t err_code;
     bool retry_ble_send = false;

     uint64_t last_sample_timestamp;
     uint16_t index = 0;
     uint16_t fifo_level;


     struct bmi160_sensor_data accel_data[WATERMARK_FRAMES];
     uint8_t accel_frames_req = WATERMARK_FRAMES;
     uint8_t accel_index;
     
     last_sample_timestamp = rtc_timestamp_get();
     //uint16_t sample_rate = 38000000000/(last_sample_timestamp - prev_timestamp);    
     //SEGGER_RTT_printf(0,"%d Hz\n",  sample_rate);
     //prev_timestamp = last_sample_timestamp;
   
     rslt = bmi160_get_fifo_data(dev);
     rslt = bmi160_extract_accel(accel_data, &accel_frames_req, dev);
     //SEGGER_RTT_printf(0,"%d, %d, %d\n", accel_data[0].x, accel_data[0].y, accel_data[0].z);     
      
     // Send accl data by BLE
     err_code = ble_biosig_svc_measurement_send(&m_biosig_svc, last_sample_timestamp,
                                    WATERMARK_FRAMES, accel_data);
     
     // NRF_ERROR_RESOURCES causes fifo to run above watermark
     // Must flush fifo to re-trigger watermark interrupt.
     if (err_code == NRF_ERROR_RESOURCES) {       
        get_fifo_byte_counter(&fifo_level, dev);
      // SEGGER_RTT_printf(0, "fifo level: %d\n", fifo_level);
       if (fifo_level >= WATERMARK_FRAMES * BYTES_PER_FRAME - 2) {
         bmi160_set_fifo_flush(dev);
         //SEGGER_RTT_printf(0, "interrupt %d, flushed %d\n", int_cnt, flush);
         flush++;
       }
     }
     return rslt;
}
 
  
static void bmi160_int_handler(nrfx_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
{   
    watermark_triggered = true;
 //   SEGGER_RTT_printf(0,"int. %d\n", int_cnt);
    int_cnt++;
}

void bmi160_init_intb_gpio(struct bmi160_dev *dev)
{
    ret_code_t err_code;

    uint8_t pin_num =  BMI160_SPI_DEV0_INTB_PIN;

    if (!nrfx_gpiote_is_init())
    {
        err_code = nrfx_gpiote_init();
        APP_ERROR_CHECK(err_code);
    }

    nrfx_gpiote_in_config_t in_config = NRFX_GPIOTE_CONFIG_IN_SENSE_HITOLO(true);
    in_config.pull = NRF_GPIO_PIN_PULLUP;

    err_code = nrfx_gpiote_in_init(pin_num, &in_config, bmi160_int_handler);
    APP_ERROR_CHECK(err_code);

    nrfx_gpiote_in_event_enable(pin_num, true);
}

/**@brief Function for application main entry.
 */

int main(void)
{
    bool erase_bonds;

    // Initialize timers
    log_init();
    timers_init();

    // Delay startup to allow power harvesting to ramp up
    lfclk_request();  //turn on here because we need it before softdevice is started
    m_startup_delay = true;
    ret_code_t err_code = app_timer_start(m_startup_delay_timer_id, STARTUP_DELAY, NULL);
    APP_ERROR_CHECK(err_code);

    while (m_startup_delay) 
    { 
        idle_state_handle();
    }

    // Remainder of initialization
    rtc_config();
    buttons_leds_init(&erase_bonds);
    power_management_init();
    ble_stack_init();
    sd_power_dcdc_mode_set(NRF_POWER_DCDC_ENABLE);
    gap_params_init();
    gatt_init();    
    services_init();
    advertising_init();
    conn_params_init();
    peer_manager_init();
    //application_timers_start();
    advertising_start(erase_bonds);
    // wait for RTC to finish initializing
    while (!m_rtc_init) 
    { 
        idle_state_handle();
    }

    spi_init();
    bmi160_init_and_config(&sensor);
    bmi160_init_intb_gpio(&sensor);
    bmi160_set_fifo_flush(&sensor);    
    watermark_triggered = false;
    
    // Enter main loop.
    while (1) {
      if (watermark_triggered) {
        read_sensor_accel_headerless(&sensor);
        watermark_triggered = false;        
      }
      idle_state_handle();
    }
}